In [1]:
#import the pandas library as pd
import pandas as pd

In [3]:
#read the csv file with pandas and store in nba
nba = pd.read_csv("nba.csv")

## Shared Methods and Attributes

In [21]:
nba = pd.read_csv("nba.csv")

In [5]:
nba.head() #displays the top 5 rows of the dataframe

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
0,Avery Bradley,Boston Celtics,0.0,PG,25.0,6-2,180.0,Texas,7730337.0
1,Jae Crowder,Boston Celtics,99.0,SF,25.0,6-6,235.0,Marquette,6796117.0
2,John Holland,Boston Celtics,30.0,SG,27.0,6-5,205.0,Boston University,NaN
3,R.J. Hunter,Boston Celtics,28.0,SG,22.0,6-5,185.0,Georgia State,1148640.0
4,Jonas Jerebko,Boston Celtics,8.0,PF,29.0,6-10,231.0,NaN,5000000.0

In [6]:
nba.tail() #displays the last 5 rows of the dataframe

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
453,Shelvin Mack,Utah Jazz,8.0,PG,26.0,6-3,203.0,Butler,2433333.0
454,Raul Neto,Utah Jazz,25.0,PG,24.0,6-1,179.0,NaN,900000.0
455,Tibor Pleiss,Utah Jazz,21.0,C,26.0,7-3,256.0,NaN,2900000.0
456,Jeff Withey,Utah Jazz,24.0,C,26.0,7-0,231.0,Kansas,947276.0
457,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [22]:
nba.index #displays the information about the index of the dataframe, start - end - incremental values

RangeIndex(start=0, stop=458, step=1)

In [23]:
nba.values #displays an array of the object attributes (all cols)

array([['Avery Bradley', 'Boston Celtics', 0.0, ..., 180.0, 'Texas',
        7730337.0],
       ['Jae Crowder', 'Boston Celtics', 99.0, ..., 235.0, 'Marquette',
        6796117.0],
       ['John Holland', 'Boston Celtics', 30.0, ..., 205.0,
        'Boston University', nan],
       ...,
       ['Tibor Pleiss', 'Utah Jazz', 21.0, ..., 256.0, nan, 2900000.0],
       ['Jeff Withey', 'Utah Jazz', 24.0, ..., 231.0, 'Kansas', 947276.0],
       [nan, nan, nan, ..., nan, nan, nan]], dtype=object)

In [9]:
nba.shape #renders information about the size of the dataframe object

(458, 9)

In [13]:
nba.dtypes #renders information about the type of the dataframe object

Name         object
Team         object
Number      float64
Position     object
Age         float64
Height       object
Weight      float64
College      object
Salary      float64
dtype: object

In [15]:
nba.columns #displays information about the columns of the dataframe

Index(['Name', 'Team', 'Number', 'Position', 'Age', 'Height', 'Weight',
       'College', 'Salary'],
      dtype='object')

In [24]:
nba.axes #renders information about the axes of the dataframe inclusing index and all the columns

[RangeIndex(start=0, stop=458, step=1),
 Index(['Name', 'Team', 'Number', 'Position', 'Age', 'Height', 'Weight',
        'College', 'Salary'],
       dtype='object')]

In [25]:
nba.info() #renders information about the  type of the objects in each columns

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 458 entries, 0 to 457
Data columns (total 9 columns):
Name        457 non-null object
Team        457 non-null object
Number      457 non-null float64
Position    457 non-null object
Age         457 non-null float64
Height      457 non-null object
Weight      457 non-null float64
College     373 non-null object
Salary      446 non-null float64
dtypes: float64(4), object(5)
memory usage: 32.3+ KB

In [26]:
nba.get_dtype_counts() #renders information about the count of each data type in each dataframe

float64    4
object     5
dtype: int64

## Difference between Shared Methods

In [34]:
 rev = pd.read_csv("revenue.csv", index_col= "Date")

In [38]:
s = pd.Series([1, 2, 3]) #create a pandas series
s.sum()#sum all the values in the series

6

In [40]:
rev.sum() #sum all the values of the pandas dataframe together, notice this sum sums numbers veritcally

New York       5475
Los Angeles    5134
Miami          5641
dtype: int64

In [42]:
rev.sum(axis= 1) # or rev.sum(axis="columns") will sum the values in each row instead

Date
1/1/16     1606
1/2/16     2060
1/3/16      967
1/4/16     2519
1/5/16      438
1/6/16     1935
1/7/16     1234
1/8/16     2313
1/9/16     2623
1/10/16     555
dtype: int64

## Select One Column from a Dataframe

In [ ]:
nba = pd.read_csv("pokemon.csv")

In [43]:
nba.head(3)

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
0,Avery Bradley,Boston Celtics,0.0,PG,25.0,6-2,180.0,Texas,7730337.0
1,Jae Crowder,Boston Celtics,99.0,SF,25.0,6-6,235.0,Marquette,6796117.0
2,John Holland,Boston Celtics,30.0,SG,27.0,6-5,205.0,Boston University,NaN

In [61]:
nba.Name # list all the name attributes of the dataframe - does not work if attribute has spaces in name
output = None #use this line to skip output results

In [62]:
nba.Number
Output = None

In [63]:
nba.Salary
Output = None

In [66]:
nba["Name"] #better way to extract columns
Output = None
nba["Salary"]
Output = None

In [69]:
type(nba["Name"]) #note the name of the attribute

pandas.core.series.Series

## Select Two or More Columns from A Dataframe

In [72]:
nba = pd.read_csv("nba.csv")
nba.head()

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
0,Avery Bradley,Boston Celtics,0.0,PG,25.0,6-2,180.0,Texas,7730337.0
1,Jae Crowder,Boston Celtics,99.0,SF,25.0,6-6,235.0,Marquette,6796117.0
2,John Holland,Boston Celtics,30.0,SG,27.0,6-5,205.0,Boston University,NaN
3,R.J. Hunter,Boston Celtics,28.0,SG,22.0,6-5,185.0,Georgia State,1148640.0
4,Jonas Jerebko,Boston Celtics,8.0,PF,29.0,6-10,231.0,NaN,5000000.0

In [76]:
nba[["Team", "Name"]] # a list inside a list will allow for multiple extractions in the order entered

                       Team                     Name
0            Boston Celtics            Avery Bradley
1            Boston Celtics              Jae Crowder
2            Boston Celtics             John Holland
3            Boston Celtics              R.J. Hunter
4            Boston Celtics            Jonas Jerebko
5            Boston Celtics             Amir Johnson
6            Boston Celtics            Jordan Mickey
7            Boston Celtics             Kelly Olynyk
8            Boston Celtics             Terry Rozier
9            Boston Celtics             Marcus Smart
10           Boston Celtics          Jared Sullinger
11           Boston Celtics            Isaiah Thomas
12           Boston Celtics              Evan Turner
13           Boston Celtics              James Young
14           Boston Celtics             Tyler Zeller
15            Brooklyn Nets         Bojan Bogdanovic
16            Brooklyn Nets             Markel Brown
17            Brooklyn Nets          Wayne Ellington
18            Brooklyn Nets  Rondae Hollis-Jefferson
19            Brooklyn Nets             Jarrett Jack
20            Brooklyn Nets           Sergey Karasev
21            Brooklyn Nets          Sean Kilpatrick
22            Brooklyn Nets             Shane Larkin
23            Brooklyn Nets              Brook Lopez
24            Brooklyn Nets         Chris McCullough
25            Brooklyn Nets              Willie Reed
26            Brooklyn Nets          Thomas Robinson
27            Brooklyn Nets               Henry Sims
28            Brooklyn Nets             Donald Sloan
29            Brooklyn Nets           Thaddeus Young
..                      ...                      ...
428  Portland Trail Blazers          Al-Farouq Aminu
429  Portland Trail Blazers          Pat Connaughton
430  Portland Trail Blazers             Allen Crabbe
431  Portland Trail Blazers                 Ed Davis
432  Portland Trail Blazers         Maurice Harkless
433  Portland Trail Blazers         Gerald Henderson
434  Portland Trail Blazers              Chris Kaman
435  Portland Trail Blazers           Meyers Leonard
436  Portland Trail Blazers           Damian Lillard
437  Portland Trail Blazers            C.J. McCollum
438  Portland Trail Blazers             Luis Montero
439  Portland Trail Blazers            Mason Plumlee
440  Portland Trail Blazers            Brian Roberts
441  Portland Trail Blazers              Noah Vonleh
442               Utah Jazz            Trevor Booker
443               Utah Jazz               Trey Burke
444               Utah Jazz               Alec Burks
445               Utah Jazz               Dante Exum
446               Utah Jazz           Derrick Favors
447               Utah Jazz              Rudy Gobert
448               Utah Jazz           Gordon Hayward
449               Utah Jazz              Rodney Hood
450               Utah Jazz               Joe Ingles
451               Utah Jazz            Chris Johnson
452               Utah Jazz               Trey Lyles
453               Utah Jazz             Shelvin Mack
454               Utah Jazz                Raul Neto
455               Utah Jazz             Tibor Pleiss
456               Utah Jazz              Jeff Withey
457                     NaN                      NaN

[458 rows x 2 columns]

In [80]:
nba[["Number", "College", "Salary"]].tail()
Output = None

In [83]:
select = ["Name", "Salary", "College"] #cleaner way for the same extraction
nba[select]
Output = None

## Add a new Column to Dataframe

In [85]:
nba["Sport"] = "Basketball"

In [87]:
nba.head(3)

,Name,Team,Number,Position,Age,Height,Weight,College,Salary,Sport
0,Avery Bradley,Boston Celtics,0.0,PG,25.0,6-2,180.0,Texas,7730337.0,Basketball
1,Jae Crowder,Boston Celtics,99.0,SF,25.0,6-6,235.0,Marquette,6796117.0,Basketball
2,John Holland,Boston Celtics,30.0,SG,27.0,6-5,205.0,Boston University,NaN,Basketball

In [88]:
nba["League"] = "NBA"

In [89]:
nba.head(3)

,Name,Team,Number,Position,Age,Height,Weight,College,Salary,Sport,League
0,Avery Bradley,Boston Celtics,0.0,PG,25.0,6-2,180.0,Texas,7730337.0,Basketball,NBA
1,Jae Crowder,Boston Celtics,99.0,SF,25.0,6-6,235.0,Marquette,6796117.0,Basketball,NBA
2,John Holland,Boston Celtics,30.0,SG,27.0,6-5,205.0,Boston University,NaN,Basketball,NBA

In [ ]:
nba = pd.read_csv("nba.csv") #import again o get original data form back
nba.head()

In [98]:
nba.insert(0, column = "League", value = "National Basketball Association", allow_duplicates=True)

In [100]:
nba.head(3)

,League,Name,Team,Number,Position,Age,Height,Weight,College,Salary,Sport,League
0,National Basketball Association,Avery Bradley,Boston Celtics,0.0,PG,25.0,6-2,180.0,Texas,7730337.0,Basketball,NBA
1,National Basketball Association,Jae Crowder,Boston Celtics,99.0,SF,25.0,6-6,235.0,Marquette,6796117.0,Basketball,NBA
2,National Basketball Association,John Holland,Boston Celtics,30.0,SG,27.0,6-5,205.0,Boston University,NaN,Basketball,NBA

## Broadcasting Operations

In [103]:
nba = pd.read_csv("nba.csv")
nba.head(3)

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
0,Avery Bradley,Boston Celtics,0.0,PG,25.0,6-2,180.0,Texas,7730337.0
1,Jae Crowder,Boston Celtics,99.0,SF,25.0,6-6,235.0,Marquette,6796117.0
2,John Holland,Boston Celtics,30.0,SG,27.0,6-5,205.0,Boston University,NaN

In [105]:
nba["Age"].add(5).tail() #one way to add to a col

453    31.0
454    29.0
455    31.0
456    31.0
457     NaN
Name: Age, dtype: float64

In [108]:
(nba["Age"] + 5).tail() #another way to add to a col

453    31.0
454    29.0
455    31.0
456    31.0
457     NaN
Name: Age, dtype: float64

In [111]:
nba["Salary"].sub(500000).head() #another way to substract from a col

0    7230337.0
1    6296117.0
2          NaN
3     648640.0
4    4500000.0
Name: Salary, dtype: float64

In [113]:
nba["Weight"].mul(0.30454).head()

0    54.81720
1    71.56690
2    62.43070
3    56.33990
4    70.34874
Name: Weight, dtype: float64

In [116]:
nba["Weight(kg)"] = nba["Weight"].mul(0.4345)

In [117]:
nba.head(3)

,Name,Team,Number,Position,Age,Height,Weight,College,Salary,Weight(kg)
0,Avery Bradley,Boston Celtics,0.0,PG,25.0,6-2,180.0,Texas,7730337.0,78.2100
1,Jae Crowder,Boston Celtics,99.0,SF,25.0,6-6,235.0,Marquette,6796117.0,102.1075
2,John Holland,Boston Celtics,30.0,SG,27.0,6-5,205.0,Boston University,NaN,89.0725

## A Review of the .value_counts() Method

In [118]:
nba = pd.read_csv("nba.csv")
nba.head(3)

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
0,Avery Bradley,Boston Celtics,0.0,PG,25.0,6-2,180.0,Texas,7730337.0
1,Jae Crowder,Boston Celtics,99.0,SF,25.0,6-6,235.0,Marquette,6796117.0
2,John Holland,Boston Celtics,30.0,SG,27.0,6-5,205.0,Boston University,NaN

In [120]:
nba["Team"].value_counts().head()

New Orleans Pelicans    19
Memphis Grizzlies       18
New York Knicks         16
Milwaukee Bucks         16
Los Angeles Clippers    15
Name: Team, dtype: int64

In [121]:
nba["Position"].value_counts().head()

SG    102
PF    100
PG     92
SF     85
C      78
Name: Position, dtype: int64

In [123]:
nba["Position"].value_counts().head(1)

SG    102
Name: Position, dtype: int64

In [125]:
nba["Salary"].value_counts().head()

947276.0     31
845059.0     18
525093.0     13
981348.0      6
1100602.0     5
Name: Salary, dtype: int64

## Drop Rows with Null Values

In [127]:
nba.dropna().tail() #removes any rows from the data frame that have any NaN value at all

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
449,Rodney Hood,Utah Jazz,5.0,SG,23.0,6-8,206.0,Duke,1348440.0
451,Chris Johnson,Utah Jazz,23.0,SF,26.0,6-6,206.0,Dayton,981348.0
452,Trey Lyles,Utah Jazz,41.0,PF,20.0,6-10,234.0,Kentucky,2239800.0
453,Shelvin Mack,Utah Jazz,8.0,PG,26.0,6-3,203.0,Butler,2433333.0
456,Jeff Withey,Utah Jazz,24.0,C,26.0,7-0,231.0,Kansas,947276.0

In [130]:
nba.dropna(how="all") #if you want to keep data with some valid value add the "how" paramter in there
Output = False

In [131]:
nba.dropna(how="all", inplace = True) #to permanently replace the removed rows use the inplace parameter

In [134]:
nba.dropna(axis=1).head(3) # axis 1 represents columns and dropna will again drop all the columsn with NaN; not permanently until we call inplace again

            Name            Team  Number Position   Age Height  Weight
0  Avery Bradley  Boston Celtics     0.0       PG  25.0    6-2   180.0
1    Jae Crowder  Boston Celtics    99.0       SF  25.0    6-6   235.0
2   John Holland  Boston Celtics    30.0       SG  27.0    6-5   205.0

In [135]:
nba.dropna(subset=["Salary"]).head(3) #to remove the Row in the specified column that has a NaN, not the entire column

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
0,Avery Bradley,Boston Celtics,0.0,PG,25.0,6-2,180.0,Texas,7730337.0
1,Jae Crowder,Boston Celtics,99.0,SF,25.0,6-6,235.0,Marquette,6796117.0
3,R.J. Hunter,Boston Celtics,28.0,SG,22.0,6-5,185.0,Georgia State,1148640.0

## Fill in Null Values with the .fillna() Method

In [136]:
nba = pd.read_csv("nba.csv")
nba.head(3)

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
0,Avery Bradley,Boston Celtics,0.0,PG,25.0,6-2,180.0,Texas,7730337.0
1,Jae Crowder,Boston Celtics,99.0,SF,25.0,6-6,235.0,Marquette,6796117.0
2,John Holland,Boston Celtics,30.0,SG,27.0,6-5,205.0,Boston University,NaN

In [139]:
nba.fillna(value=0).head() # will replace all the NaN values with 0, but this usually doesn't make sense for various data types

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
0,Avery Bradley,Boston Celtics,0.0,PG,25.0,6-2,180.0,Texas,7730337.0
1,Jae Crowder,Boston Celtics,99.0,SF,25.0,6-6,235.0,Marquette,6796117.0
2,John Holland,Boston Celtics,30.0,SG,27.0,6-5,205.0,Boston University,0.0
3,R.J. Hunter,Boston Celtics,28.0,SG,22.0,6-5,185.0,Georgia State,1148640.0
4,Jonas Jerebko,Boston Celtics,8.0,PF,29.0,6-10,231.0,0,5000000.0

In [140]:
nba["Salary"].fillna(0, inplace= True) #replace an int column with 0

In [204]:
nba["College"].fillna("No College", inplace=True) #replace a string column with an appropriate replacement

## The .astype() Method
### Allows to convert the data types from one type to another

In [165]:
nba = pd.read_csv("nba.csv")
nba.tail(3)
nba.info() #notice the number of columns are no the same

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 458 entries, 0 to 457
Data columns (total 9 columns):
Name        457 non-null object
Team        457 non-null object
Number      457 non-null float64
Position    457 non-null object
Age         457 non-null float64
Height      457 non-null object
Weight      457 non-null float64
College     373 non-null object
Salary      446 non-null float64
dtypes: float64(4), object(5)
memory usage: 32.3+ KB

In [205]:
nba.dropna(how="all") #drop all the NaNs from the last row
nba["Salary"].fillna(0, inplace=True) #replace NaN from salary with 0
nba["College"].fillna(value = "No College", inplace = True)#replace the string NaN from college column with a valid string
nba["Number"].fillna(value = 0, inplace= True)
nba["Age"].fillna(value=0, inplace = True)

In [206]:
nba.dtypes #see the types of the columns; notice how after removing the NaNs the

Name         object
Team         object
Number        int32
Position     object
Age         float64
Height       object
Weight      float64
College      object
Salary        int32
dtype: object

In [207]:
nba.head()

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
0,Avery Bradley,Boston Celtics,0,PG,25.0,6-2,180.0,Texas,7730337
1,Jae Crowder,Boston Celtics,99,SF,25.0,6-6,235.0,Marquette,6796117
2,John Holland,Boston Celtics,30,SG,27.0,6-5,205.0,Boston University,0
3,R.J. Hunter,Boston Celtics,28,SG,22.0,6-5,185.0,Georgia State,1148640
4,Jonas Jerebko,Boston Celtics,8,PF,29.0,6-10,231.0,No College,5000000

In [208]:
nba.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 458 entries, 0 to 457
Data columns (total 9 columns):
Name        457 non-null object
Team        457 non-null object
Number      458 non-null int32
Position    457 non-null object
Age         458 non-null float64
Height      457 non-null object
Weight      457 non-null float64
College     458 non-null object
Salary      458 non-null int32
dtypes: float64(2), int32(2), object(5)
memory usage: 28.7+ KB

In [209]:
nba["Salary"] = nba["Salary"].astype("int") #changing the type of the column

In [210]:
nba.info() #notice the change in the type of the salary column type

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 458 entries, 0 to 457
Data columns (total 9 columns):
Name        457 non-null object
Team        457 non-null object
Number      458 non-null int32
Position    457 non-null object
Age         458 non-null float64
Height      457 non-null object
Weight      457 non-null float64
College     458 non-null object
Salary      458 non-null int32
dtypes: float64(2), int32(2), object(5)
memory usage: 28.7+ KB

In [211]:
nba ["Number"] = nba["Number"].astype("int") #convert the type of the numbers column from float to int
Output = False

In [216]:
nba["Age"] = nba["Age"].astype("int") #replace

In [217]:
nba.head(3)

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
0,Avery Bradley,Boston Celtics,0,PG,25,6-2,180.0,Texas,7730337
1,Jae Crowder,Boston Celtics,99,SF,25,6-6,235.0,Marquette,6796117
2,John Holland,Boston Celtics,30,SG,27,6-5,205.0,Boston University,0

In [219]:
nba["Position"].nunique()

5

In [225]:
nba["College"].astype("category") #catagorize the college column using the catagory datatype
Output = False

## Sort a DataFrame with the .sort_values() Method, Part I

In [227]:
nba = pd.read_csv("nba.csv")
nba.head(3)

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
0,Avery Bradley,Boston Celtics,0.0,PG,25.0,6-2,180.0,Texas,7730337.0
1,Jae Crowder,Boston Celtics,99.0,SF,25.0,6-6,235.0,Marquette,6796117.0
2,John Holland,Boston Celtics,30.0,SG,27.0,6-5,205.0,Boston University,NaN

In [234]:
nba.sort_values("Name", ascending=False)
nba.sort_values("Age", ascending=False)
nba.sort_values("Salary", ascending = False)
Output = False

In [ ]:
 #By default if we are sorting a column with sort_values() and we have NaN there it will go to the end of the line

In [235]:
nba.sort_values("Salary").tail()

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
350,Briante Weber,Miami Heat,12.0,PG,23.0,6-2,165.0,Virginia Commonwealth,NaN
353,Dorell Wright,Miami Heat,11.0,SF,30.0,6-9,205.0,NaN,NaN
397,Axel Toupane,Denver Nuggets,6.0,SG,23.0,6-7,210.0,NaN,NaN
409,Greg Smith,Minnesota Timberwolves,4.0,PF,25.0,6-10,250.0,Fresno State,NaN
457,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [244]:
nba = pd.read_csv("nba.csv")
nba.sort_values(["Team", "Name"], ascending = [False, False]) #sort Team with True ascending and Name with descending
nba.head(3)

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
0,Avery Bradley,Boston Celtics,0.0,PG,25.0,6-2,180.0,Texas,7730337.0
1,Jae Crowder,Boston Celtics,99.0,SF,25.0,6-6,235.0,Marquette,6796117.0
2,John Holland,Boston Celtics,30.0,SG,27.0,6-5,205.0,Boston University,NaN

## Sort Dataframe with the .sort_index() Method

In [246]:
nba = pd.read_csv("nba.csv")
nba.head(3)

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
0,Avery Bradley,Boston Celtics,0.0,PG,25.0,6-2,180.0,Texas,7730337.0
1,Jae Crowder,Boston Celtics,99.0,SF,25.0,6-6,235.0,Marquette,6796117.0
2,John Holland,Boston Celtics,30.0,SG,27.0,6-5,205.0,Boston University,NaN

In [248]:
nba.sort_values(["Number", "Salary", "Name"], inplace = True)
nba.tail(3)

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
68,Lucas Nogueira,Toronto Raptors,92.0,C,23.0,7-0,220.0,NaN,1842000.0
1,Jae Crowder,Boston Celtics,99.0,SF,25.0,6-6,235.0,Marquette,6796117.0
457,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [251]:
nba.sort_index() #return back to the original shape
Output = False

In [254]:
nba.sort_index(ascending = False, inplace = True) #return the data sorted from index HIGHEST to LOWEST
nba.tail(3)

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
2,John Holland,Boston Celtics,30.0,SG,27.0,6-5,205.0,Boston University,NaN
1,Jae Crowder,Boston Celtics,99.0,SF,25.0,6-6,235.0,Marquette,6796117.0
0,Avery Bradley,Boston Celtics,0.0,PG,25.0,6-2,180.0,Texas,7730337.0

## Rank Values with the .rank() Method

In [288]:
nba = pd.read_csv("nba.csv") #import all the data

In [289]:
nba = pd.read_csv("nba.csv").dropna(how = "all") #drop the rows with all NaN

In [290]:
nba["Salary"] = nba["Salary"].fillna(0) #replace all the NaN in Salary column with 0

In [291]:
nba["Salary Rank"] = nba["Salary"].rank(ascending=True).astype("int")

In [292]:
nba.head(3)

,Name,Team,Number,Position,Age,Height,Weight,College,Salary,Salary Rank
0,Avery Bradley,Boston Celtics,0.0,PG,25.0,6-2,180.0,Texas,7730337.0,361
1,Jae Crowder,Boston Celtics,99.0,SF,25.0,6-6,235.0,Marquette,6796117.0,348
2,John Holland,Boston Celtics,30.0,SG,27.0,6-5,205.0,Boston University,0.0,6

In [294]:
nba.sort_values("Salary Rank", ascending=True)
Output = False